"user strict";
//2. З клавіатури вводиться ціна товару і кількість грошей. Якщо грошей не
//вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то
//пропонуємо купити лотерею за 4 грн.
// Крок 0 Виводимо позначення
// - ціна товару -productPrice
// - кількість грошей - userMoney
// Крок 1 Введення величин
const productPrice = parseFloat(prompt("Введіть ціну товару"));
const userMoney = parseFloat(prompt("Кількість грошей"));
// Крок 2 Розв'язання задачі
if (userMoney < productPrice) alert("Недостатньо коштів");
else {
  alert("Вітаю з покупкою");
  if (userMoney - productPrice >= 4) alert("Рекомендуємо купити лотерею");
}
